RIOT-OS/RIOT/cpu/efm32/families/efr32zg23/include/vendor/efr32zg23_lcd.h
/** @} End of group EFR32ZG23_LCD */

/**************************************************************************//**
 * @addtogroup EFR32ZG23_LCD
 * @{
 * @defgroup EFR32ZG23_LCD_BitFields LCD Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for LCD IPVERSION */
#define _LCD_IPVERSION_RESETVALUE            0x00000001UL                               /**< Default value for LCD_IPVERSION             */
#define _LCD_IPVERSION_MASK                  0xFFFFFFFFUL                               /**< Mask for LCD_IPVERSION                      */
#define _LCD_IPVERSION_IPVERSION_SHIFT       0                                          /**< Shift value for LCD_IPVERSION               */
#define _LCD_IPVERSION_IPVERSION_MASK        0xFFFFFFFFUL                               /**< Bit mask for LCD_IPVERSION                  */
#define _LCD_IPVERSION_IPVERSION_DEFAULT     0x00000001UL                               /**< Mode DEFAULT for LCD_IPVERSION              */
#define LCD_IPVERSION_IPVERSION_DEFAULT      (_LCD_IPVERSION_IPVERSION_DEFAULT << 0)    /**< Shifted mode DEFAULT for LCD_IPVERSION      */

/* Bit fields for LCD EN */
#define _LCD_EN_RESETVALUE                   0x00000000UL                               /**< Default value for LCD_EN                    */
#define _LCD_EN_MASK                         0x00000003UL                               /**< Mask for LCD_EN                             */
#define LCD_EN_EN                            (0x1UL << 0)                               /**< Enable                                      */
#define _LCD_EN_EN_SHIFT                     0                                          /**< Shift value for LCD_EN                      */
#define _LCD_EN_EN_MASK                      0x1UL                                      /**< Bit mask for LCD_EN                         */
#define _LCD_EN_EN_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for LCD_EN                     */
#define _LCD_EN_EN_DISABLE                   0x00000000UL                               /**< Mode DISABLE for LCD_EN                     */
#define _LCD_EN_EN_ENABLE                    0x00000001UL                               /**< Mode ENABLE for LCD_EN                      */
#define LCD_EN_EN_DEFAULT                    (_LCD_EN_EN_DEFAULT << 0)                  /**< Shifted mode DEFAULT for LCD_EN             */
#define LCD_EN_EN_DISABLE                    (_LCD_EN_EN_DISABLE << 0)                  /**< Shifted mode DISABLE for LCD_EN             */
#define LCD_EN_EN_ENABLE                     (_LCD_EN_EN_ENABLE << 0)                   /**< Shifted mode ENABLE for LCD_EN              */
#define LCD_EN_DISABLING                     (0x1UL << 1)                               /**< Disablement busy status                     */
#define _LCD_EN_DISABLING_SHIFT              1                                          /**< Shift value for LCD_DISABLING               */
#define _LCD_EN_DISABLING_MASK               0x2UL                                      /**< Bit mask for LCD_DISABLING                  */
#define _LCD_EN_DISABLING_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for LCD_EN                     */
#define LCD_EN_DISABLING_DEFAULT             (_LCD_EN_DISABLING_DEFAULT << 1)           /**< Shifted mode DEFAULT for LCD_EN             */

/* Bit fields for LCD SWRST */
#define _LCD_SWRST_RESETVALUE                0x00000000UL                               /**< Default value for LCD_SWRST                 */
#define _LCD_SWRST_MASK                      0x00000003UL                               /**< Mask for LCD_SWRST                          */
#define LCD_SWRST_SWRST                      (0x1UL << 0)                               /**< Software reset command                      */
#define _LCD_SWRST_SWRST_SHIFT               0                                          /**< Shift value for LCD_SWRST                   */
#define _LCD_SWRST_SWRST_MASK                0x1UL                                      /**< Bit mask for LCD_SWRST                      */
#define _LCD_SWRST_SWRST_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LCD_SWRST                  */
#define LCD_SWRST_SWRST_DEFAULT              (_LCD_SWRST_SWRST_DEFAULT << 0)            /**< Shifted mode DEFAULT for LCD_SWRST          */
#define LCD_SWRST_RESETTING                  (0x1UL << 1)                               /**< Software reset busy status                  */
#define _LCD_SWRST_RESETTING_SHIFT           1                                          /**< Shift value for LCD_RESETTING               */
#define _LCD_SWRST_RESETTING_MASK            0x2UL                                      /**< Bit mask for LCD_RESETTING                  */
#define _LCD_SWRST_RESETTING_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for LCD_SWRST                  */
#define LCD_SWRST_RESETTING_DEFAULT          (_LCD_SWRST_RESETTING_DEFAULT << 1)        /**< Shifted mode DEFAULT for LCD_SWRST          */

/* Bit fields for LCD CTRL */
#define _LCD_CTRL_RESETVALUE                 0x00100000UL                               /**< Default value for LCD_CTRL                  */
#define _LCD_CTRL_MASK                       0x7F1D0006UL                               /**< Mask for LCD_CTRL                           */
#define _LCD_CTRL_UDCTRL_SHIFT               1                                          /**< Shift value for LCD_UDCTRL                  */
#define _LCD_CTRL_UDCTRL_MASK                0x6UL                                      /**< Bit mask for LCD_UDCTRL                     */
#define _LCD_CTRL_UDCTRL_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LCD_CTRL                   */
#define _LCD_CTRL_UDCTRL_REGULAR             0x00000000UL                               /**< Mode REGULAR for LCD_CTRL                   */
#define _LCD_CTRL_UDCTRL_FRAMESTART          0x00000001UL                               /**< Mode FRAMESTART for LCD_CTRL                */
#define _LCD_CTRL_UDCTRL_FCEVENT             0x00000002UL                               /**< Mode FCEVENT for LCD_CTRL                   */
#define _LCD_CTRL_UDCTRL_DISPLAYEVENT        0x00000003UL                               /**< Mode DISPLAYEVENT for LCD_CTRL              */
#define LCD_CTRL_UDCTRL_DEFAULT              (_LCD_CTRL_UDCTRL_DEFAULT << 1)            /**< Shifted mode DEFAULT for LCD_CTRL           */
#define LCD_CTRL_UDCTRL_REGULAR              (_LCD_CTRL_UDCTRL_REGULAR << 1)            /**< Shifted mode REGULAR for LCD_CTRL           */
#define LCD_CTRL_UDCTRL_FRAMESTART           (_LCD_CTRL_UDCTRL_FRAMESTART << 1)         /**< Shifted mode FRAMESTART for LCD_CTRL        */
#define LCD_CTRL_UDCTRL_FCEVENT              (_LCD_CTRL_UDCTRL_FCEVENT << 1)            /**< Shifted mode FCEVENT for LCD_CTRL           */
#define LCD_CTRL_UDCTRL_DISPLAYEVENT         (_LCD_CTRL_UDCTRL_DISPLAYEVENT << 1)       /**< Shifted mode DISPLAYEVENT for LCD_CTRL      */
#define LCD_CTRL_DSC                         (0x1UL << 16)                              /**< Direct Segment Control                      */
#define _LCD_CTRL_DSC_SHIFT                  16                                         /**< Shift value for LCD_DSC                     */
#define _LCD_CTRL_DSC_MASK                   0x10000UL                                  /**< Bit mask for LCD_DSC                        */
#define _LCD_CTRL_DSC_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for LCD_CTRL                   */
#define _LCD_CTRL_DSC_DISABLE                0x00000000UL                               /**< Mode DISABLE for LCD_CTRL                   */
#define _LCD_CTRL_DSC_ENABLE                 0x00000001UL                               /**< Mode ENABLE for LCD_CTRL                    */
#define LCD_CTRL_DSC_DEFAULT                 (_LCD_CTRL_DSC_DEFAULT << 16)              /**< Shifted mode DEFAULT for LCD_CTRL           */
#define LCD_CTRL_DSC_DISABLE                 (_LCD_CTRL_DSC_DISABLE << 16)              /**< Shifted mode DISABLE for LCD_CTRL           */
#define LCD_CTRL_DSC_ENABLE                  (_LCD_CTRL_DSC_ENABLE << 16)               /**< Shifted mode ENABLE for LCD_CTRL            */
#define _LCD_CTRL_WARMUPDLY_SHIFT            18                                         /**< Shift value for LCD_WARMUPDLY               */
#define _LCD_CTRL_WARMUPDLY_MASK             0x1C0000UL                                 /**< Bit mask for LCD_WARMUPDLY                  */
#define _LCD_CTRL_WARMUPDLY_DEFAULT          0x00000004UL                               /**< Mode DEFAULT for LCD_CTRL                   */
#define _LCD_CTRL_WARMUPDLY_WARMUP1          0x00000000UL                               /**< Mode WARMUP1 for LCD_CTRL                   */
#define _LCD_CTRL_WARMUPDLY_WARMUP31         0x00000001UL                               /**< Mode WARMUP31 for LCD_CTRL                  */
#define _LCD_CTRL_WARMUPDLY_WARMUP63         0x00000002UL                               /**< Mode WARMUP63 for LCD_CTRL                  */
#define _LCD_CTRL_WARMUPDLY_WARMUP125        0x00000003UL                               /**< Mode WARMUP125 for LCD_CTRL                 */
#define _LCD_CTRL_WARMUPDLY_WARMUP250        0x00000004UL                               /**< Mode WARMUP250 for LCD_CTRL                 */
#define _LCD_CTRL_WARMUPDLY_WARMUP500        0x00000005UL                               /**< Mode WARMUP500 for LCD_CTRL                 */
#define _LCD_CTRL_WARMUPDLY_WARMUP1000       0x00000006UL                               /**< Mode WARMUP1000 for LCD_CTRL                */
#define _LCD_CTRL_WARMUPDLY_WARMUP2000       0x00000007UL                               /**< Mode WARMUP2000 for LCD_CTRL                */
#define LCD_CTRL_WARMUPDLY_DEFAULT           (_LCD_CTRL_WARMUPDLY_DEFAULT << 18)        /**< Shifted mode DEFAULT for LCD_CTRL           */
#define LCD_CTRL_WARMUPDLY_WARMUP1           (_LCD_CTRL_WARMUPDLY_WARMUP1 << 18)        /**< Shifted mode WARMUP1 for LCD_CTRL           */
#define LCD_CTRL_WARMUPDLY_WARMUP31          (_LCD_CTRL_WARMUPDLY_WARMUP31 << 18)       /**< Shifted mode WARMUP31 for LCD_CTRL          */
#define LCD_CTRL_WARMUPDLY_WARMUP63          (_LCD_CTRL_WARMUPDLY_WARMUP63 << 18)       /**< Shifted mode WARMUP63 for LCD_CTRL          */
#define LCD_CTRL_WARMUPDLY_WARMUP125         (_LCD_CTRL_WARMUPDLY_WARMUP125 << 18)      /**< Shifted mode WARMUP125 for LCD_CTRL         */
#define LCD_CTRL_WARMUPDLY_WARMUP250         (_LCD_CTRL_WARMUPDLY_WARMUP250 << 18)      /**< Shifted mode WARMUP250 for LCD_CTRL         */
#define LCD_CTRL_WARMUPDLY_WARMUP500         (_LCD_CTRL_WARMUPDLY_WARMUP500 << 18)      /**< Shifted mode WARMUP500 for LCD_CTRL         */
#define LCD_CTRL_WARMUPDLY_WARMUP1000        (_LCD_CTRL_WARMUPDLY_WARMUP1000 << 18)     /**< Shifted mode WARMUP1000 for LCD_CTRL        */
#define LCD_CTRL_WARMUPDLY_WARMUP2000        (_LCD_CTRL_WARMUPDLY_WARMUP2000 << 18)     /**< Shifted mode WARMUP2000 for LCD_CTRL        */
#define _LCD_CTRL_PRESCALE_SHIFT             24                                         /**< Shift value for LCD_PRESCALE                */
#define _LCD_CTRL_PRESCALE_MASK              0x7F000000UL                               /**< Bit mask for LCD_PRESCALE                   */
#define _LCD_CTRL_PRESCALE_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for LCD_CTRL                   */
#define LCD_CTRL_PRESCALE_DEFAULT            (_LCD_CTRL_PRESCALE_DEFAULT << 24)         /**< Shifted mode DEFAULT for LCD_CTRL           */

/* Bit fields for LCD CMD */
#define _LCD_CMD_RESETVALUE                  0x00000000UL                               /**< Default value for LCD_CMD                   */
#define _LCD_CMD_MASK                        0x00000003UL                               /**< Mask for LCD_CMD                            */
#define LCD_CMD_LOAD                         (0x1UL << 0)                               /**< Load command                                */
#define _LCD_CMD_LOAD_SHIFT                  0                                          /**< Shift value for LCD_LOAD                    */
#define _LCD_CMD_LOAD_MASK                   0x1UL                                      /**< Bit mask for LCD_LOAD                       */
#define _LCD_CMD_LOAD_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for LCD_CMD                    */
#define LCD_CMD_LOAD_DEFAULT                 (_LCD_CMD_LOAD_DEFAULT << 0)               /**< Shifted mode DEFAULT for LCD_CMD            */
#define LCD_CMD_CLEAR                        (0x1UL << 1)                               /**< Clear command                               */
#define _LCD_CMD_CLEAR_SHIFT                 1                                          /**< Shift value for LCD_CLEAR                   */
#define _LCD_CMD_CLEAR_MASK                  0x2UL                                      /**< Bit mask for LCD_CLEAR                      */
#define _LCD_CMD_CLEAR_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for LCD_CMD                    */
#define LCD_CMD_CLEAR_DEFAULT                (_LCD_CMD_CLEAR_DEFAULT << 1)              /**< Shifted mode DEFAULT for LCD_CMD            */

/* Bit fields for LCD DISPCTRL */
#define _LCD_DISPCTRL_RESETVALUE             0x00100000UL                               /**< Default value for LCD_DISPCTRL              */
#define _LCD_DISPCTRL_MASK                   0x03700017UL                               /**< Mask for LCD_DISPCTRL                       */
#define _LCD_DISPCTRL_MUX_SHIFT              0                                          /**< Shift value for LCD_MUX                     */
#define _LCD_DISPCTRL_MUX_MASK               0x7UL                                      /**< Bit mask for LCD_MUX                        */
#define _LCD_DISPCTRL_MUX_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for LCD_DISPCTRL               */
#define _LCD_DISPCTRL_MUX_STATIC             0x00000000UL                               /**< Mode STATIC for LCD_DISPCTRL                */
#define _LCD_DISPCTRL_MUX_DUPLEX             0x00000001UL                               /**< Mode DUPLEX for LCD_DISPCTRL                */
#define _LCD_DISPCTRL_MUX_TRIPLEX            0x00000002UL                               /**< Mode TRIPLEX for LCD_DISPCTRL               */
#define _LCD_DISPCTRL_MUX_QUADRUPLEX         0x00000003UL                               /**< Mode QUADRUPLEX for LCD_DISPCTRL            */
#define LCD_DISPCTRL_MUX_DEFAULT             (_LCD_DISPCTRL_MUX_DEFAULT << 0)           /**< Shifted mode DEFAULT for LCD_DISPCTRL       */
#define LCD_DISPCTRL_MUX_STATIC              (_LCD_DISPCTRL_MUX_STATIC << 0)            /**< Shifted mode STATIC for LCD_DISPCTRL        */
#define LCD_DISPCTRL_MUX_DUPLEX              (_LCD_DISPCTRL_MUX_DUPLEX << 0)            /**< Shifted mode DUPLEX for LCD_DISPCTRL        */
#define LCD_DISPCTRL_MUX_TRIPLEX             (_LCD_DISPCTRL_MUX_TRIPLEX << 0)           /**< Shifted mode TRIPLEX for LCD_DISPCTRL       */
#define LCD_DISPCTRL_MUX_QUADRUPLEX          (_LCD_DISPCTRL_MUX_QUADRUPLEX << 0)        /**< Shifted mode QUADRUPLEX for LCD_DISPCTRL    */
#define LCD_DISPCTRL_WAVE                    (0x1UL << 4)                               /**< Waveform Selection                          */
#define _LCD_DISPCTRL_WAVE_SHIFT             4                                          /**< Shift value for LCD_WAVE                    */
#define _LCD_DISPCTRL_WAVE_MASK              0x10UL                                     /**< Bit mask for LCD_WAVE                       */
#define _LCD_DISPCTRL_WAVE_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for LCD_DISPCTRL               */
#define _LCD_DISPCTRL_WAVE_TYPEB             0x00000000UL                               /**< Mode TYPEB for LCD_DISPCTRL                 */
#define _LCD_DISPCTRL_WAVE_TYPEA             0x00000001UL                               /**< Mode TYPEA for LCD_DISPCTRL                 */
#define LCD_DISPCTRL_WAVE_DEFAULT            (_LCD_DISPCTRL_WAVE_DEFAULT << 4)          /**< Shifted mode DEFAULT for LCD_DISPCTRL       */
#define LCD_DISPCTRL_WAVE_TYPEB              (_LCD_DISPCTRL_WAVE_TYPEB << 4)            /**< Shifted mode TYPEB for LCD_DISPCTRL         */
#define LCD_DISPCTRL_WAVE_TYPEA              (_LCD_DISPCTRL_WAVE_TYPEA << 4)            /**< Shifted mode TYPEA for LCD_DISPCTRL         */
#define _LCD_DISPCTRL_CHGRDST_SHIFT          20                                         /**< Shift value for LCD_CHGRDST                 */
#define _LCD_DISPCTRL_CHGRDST_MASK           0x700000UL                                 /**< Bit mask for LCD_CHGRDST                    */
#define _LCD_DISPCTRL_CHGRDST_DEFAULT        0x00000001UL                               /**< Mode DEFAULT for LCD_DISPCTRL               */
#define _LCD_DISPCTRL_CHGRDST_DISABLE        0x00000000UL                               /**< Mode DISABLE for LCD_DISPCTRL               */
#define _LCD_DISPCTRL_CHGRDST_ONE            0x00000001UL                               /**< Mode ONE for LCD_DISPCTRL                   */
#define _LCD_DISPCTRL_CHGRDST_TWO            0x00000002UL                               /**< Mode TWO for LCD_DISPCTRL                   */
#define _LCD_DISPCTRL_CHGRDST_THREE          0x00000003UL                               /**< Mode THREE for LCD_DISPCTRL                 */
#define _LCD_DISPCTRL_CHGRDST_FOUR           0x00000004UL                               /**< Mode FOUR for LCD_DISPCTRL                  */
#define LCD_DISPCTRL_CHGRDST_DEFAULT         (_LCD_DISPCTRL_CHGRDST_DEFAULT << 20)      /**< Shifted mode DEFAULT for LCD_DISPCTRL       */
#define LCD_DISPCTRL_CHGRDST_DISABLE         (_LCD_DISPCTRL_CHGRDST_DISABLE << 20)      /**< Shifted mode DISABLE for LCD_DISPCTRL       */
#define LCD_DISPCTRL_CHGRDST_ONE             (_LCD_DISPCTRL_CHGRDST_ONE << 20)          /**< Shifted mode ONE for LCD_DISPCTRL           */
#define LCD_DISPCTRL_CHGRDST_TWO             (_LCD_DISPCTRL_CHGRDST_TWO << 20)          /**< Shifted mode TWO for LCD_DISPCTRL           */
#define LCD_DISPCTRL_CHGRDST_THREE           (_LCD_DISPCTRL_CHGRDST_THREE << 20)        /**< Shifted mode THREE for LCD_DISPCTRL         */
#define LCD_DISPCTRL_CHGRDST_FOUR            (_LCD_DISPCTRL_CHGRDST_FOUR << 20)         /**< Shifted mode FOUR for LCD_DISPCTRL          */
#define _LCD_DISPCTRL_BIAS_SHIFT             24                                         /**< Shift value for LCD_BIAS                    */
#define _LCD_DISPCTRL_BIAS_MASK              0x3000000UL                                /**< Bit mask for LCD_BIAS                       */
#define _LCD_DISPCTRL_BIAS_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for LCD_DISPCTRL               */
#define _LCD_DISPCTRL_BIAS_STATIC            0x00000000UL                               /**< Mode STATIC for LCD_DISPCTRL                */
#define _LCD_DISPCTRL_BIAS_ONEHALF           0x00000001UL                               /**< Mode ONEHALF for LCD_DISPCTRL               */
#define _LCD_DISPCTRL_BIAS_ONETHIRD          0x00000002UL                               /**< Mode ONETHIRD for LCD_DISPCTRL              */
#define _LCD_DISPCTRL_BIAS_ONEFOURTH         0x00000003UL                               /**< Mode ONEFOURTH for LCD_DISPCTRL             */
#define LCD_DISPCTRL_BIAS_DEFAULT            (_LCD_DISPCTRL_BIAS_DEFAULT << 24)         /**< Shifted mode DEFAULT for LCD_DISPCTRL       */
#define LCD_DISPCTRL_BIAS_STATIC             (_LCD_DISPCTRL_BIAS_STATIC << 24)          /**< Shifted mode STATIC for LCD_DISPCTRL        */
#define LCD_DISPCTRL_BIAS_ONEHALF            (_LCD_DISPCTRL_BIAS_ONEHALF << 24)         /**< Shifted mode ONEHALF for LCD_DISPCTRL       */
#define LCD_DISPCTRL_BIAS_ONETHIRD           (_LCD_DISPCTRL_BIAS_ONETHIRD << 24)        /**< Shifted mode ONETHIRD for LCD_DISPCTRL      */
#define LCD_DISPCTRL_BIAS_ONEFOURTH          (_LCD_DISPCTRL_BIAS_ONEFOURTH << 24)       /**< Shifted mode ONEFOURTH for LCD_DISPCTRL     */

/* Bit fields for LCD BACFG */
#define _LCD_BACFG_RESETVALUE                0x00000007UL                               /**< Default value for LCD_BACFG                 */
#define _LCD_BACFG_MASK                      0x00FF0007UL                               /**< Mask for LCD_BACFG                          */
#define _LCD_BACFG_ASTATETOP_SHIFT           0                                          /**< Shift value for LCD_ASTATETOP               */
#define _LCD_BACFG_ASTATETOP_MASK            0x7UL                                      /**< Bit mask for LCD_ASTATETOP                  */
#define _LCD_BACFG_ASTATETOP_DEFAULT         0x00000007UL                               /**< Mode DEFAULT for LCD_BACFG                  */
#define LCD_BACFG_ASTATETOP_DEFAULT          (_LCD_BACFG_ASTATETOP_DEFAULT << 0)        /**< Shifted mode DEFAULT for LCD_BACFG          */
#define _LCD_BACFG_FCPRESC_SHIFT             16                                         /**< Shift value for LCD_FCPRESC                 */
#define _LCD_BACFG_FCPRESC_MASK              0x30000UL                                  /**< Bit mask for LCD_FCPRESC                    */
#define _LCD_BACFG_FCPRESC_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for LCD_BACFG                  */
#define _LCD_BACFG_FCPRESC_DIV1              0x00000000UL                               /**< Mode DIV1 for LCD_BACFG                     */
#define _LCD_BACFG_FCPRESC_DIV2              0x00000001UL                               /**< Mode DIV2 for LCD_BACFG                     */
#define _LCD_BACFG_FCPRESC_DIV4              0x00000002UL                               /**< Mode DIV4 for LCD_BACFG                     */
#define _LCD_BACFG_FCPRESC_DIV8              0x00000003UL                               /**< Mode DIV8 for LCD_BACFG                     */
#define LCD_BACFG_FCPRESC_DEFAULT            (_LCD_BACFG_FCPRESC_DEFAULT << 16)         /**< Shifted mode DEFAULT for LCD_BACFG          */
#define LCD_BACFG_FCPRESC_DIV1               (_LCD_BACFG_FCPRESC_DIV1 << 16)            /**< Shifted mode DIV1 for LCD_BACFG             */
#define LCD_BACFG_FCPRESC_DIV2               (_LCD_BACFG_FCPRESC_DIV2 << 16)            /**< Shifted mode DIV2 for LCD_BACFG             */
#define LCD_BACFG_FCPRESC_DIV4               (_LCD_BACFG_FCPRESC_DIV4 << 16)            /**< Shifted mode DIV4 for LCD_BACFG             */
#define LCD_BACFG_FCPRESC_DIV8               (_LCD_BACFG_FCPRESC_DIV8 << 16)            /**< Shifted mode DIV8 for LCD_BACFG             */
#define _LCD_BACFG_FCTOP_SHIFT               18                                         /**< Shift value for LCD_FCTOP                   */
#define _LCD_BACFG_FCTOP_MASK                0xFC0000UL                                 /**< Bit mask for LCD_FCTOP                      */
#define _LCD_BACFG_FCTOP_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for LCD_BACFG                  */
#define LCD_BACFG_FCTOP_DEFAULT              (_LCD_BACFG_FCTOP_DEFAULT << 18)           /**< Shifted mode DEFAULT for LCD_BACFG          */

